
public class ObjectBasic {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

//		객체지향언어
//		개념
//		실제 세계는 사물(객체)로 이루어져 있으며,
//		발생하는 모든 사건들은 사물간의 상호작용이다
		
//		객체지향언어의 주요특징
//		1. 코드의 재사용성이 높다
//		- 새로운 코드를 작성할 때 기존의 코드를 이용하여 쉽게 작성할 수 있다
//		2. 코드의 관리가 용이하다
//		- 코드간의 관계를 이용해서 적은 노력으로  쉽게 코드를 변경할 수 있다
//		3. 신뢰성이 높은 프로그래밍을 가능하게 한다
//		- 제어자(조건문)와 메서드를 이용해서 데이터를 보호하고 올바른 값을 
//		유지하도록 하며(유효성), 코드의 중복을 제거하여 코드의 불일치로 인한
//		오동작을 방지할 수 있다
		
//		# 코드의 재사용성이 높고 유지보수가 용이하다(시간과 비용을 절약)
		
//		클래스 객체
		
		
//		클래스란? 객체를 정의해 놓은 것
//		클래스의 용도 - 클래스는 객체를 생성하는데 사용된다
		
//		객체
//		Object - 물건, 목표, 실제로 존재하는 것

//		물건, 개념
		
//		객체의 정의: 실제로 존재하는 것. 사물 또는 개념
//		객체 용도: 객체가 가지고 있는 기능과 속성에 따라 다름
		
//		유형의 객체 - 책상, 의자, 자동차등 과 같은 사물
//		무형의 객체 - 수학공식, 시간, 기온등과 같은 논리나 개념
		
		
////	클래스(설계도)     객체
//		제품설계도                 제품
//		TV설계도                   TV
//		붕어빵 틀                   붕어빵

		
		
		
		
		
		
		
	}

}
